plugin -i synth-rs
echo on
verific -vlog-incdir /home/users/zaheer.ahmad/Downloads/Compiler_Validation/random_test_generator_v1/random_generated_designs/design5/rtl
verific -sv /home/users/zaheer.ahmad/Downloads/Compiler_Validation/random_test_generator_v1/random_generated_designs/design5/rtl/design5_5_6_top.v
verific -import -all design5_5_6_top

synth_rs \
    -top design5_5_6_top \
    -tech genesis \
    -goal area \
    -verilog design5_5_6_top_netlist.v \
    -no_dsp \
    -no_bram \
    -effort medium
    
write_blif accumulator.blif
write_verilog -noattr -nohex design5_5_6_top_netlist.v