plugin -i synth-rs
echo on
verific -vlog-incdir /home/users/zaheer.ahmad/Downloads/Compiler_Validation/random_test_generator_v1/random_generated_designs/design2/rtl
verific -sv /home/users/zaheer.ahmad/Downloads/Compiler_Validation/random_test_generator_v1/random_generated_designs/design2/rtl/design2_5_5_top.v
verific -import -all design2_5_5_top

synth_rs \
    -top design2_5_5_top \
    -tech genesis \
    -goal area \
    -verilog design2_5_5_top_netlist.v \
    -no_dsp \
    -no_bram \
    -effort medium
    
write_blif accumulator.blif
write_verilog -noattr -nohex design2_5_5_top_netlist.v