plugin -i synth-rs
echo on
verific -vlog-incdir /home/users/zaheer.ahmad/Downloads/Compiler_Validation/random_test_generator_v1/random_generated_designs/design3/rtl
verific -sv /home/users/zaheer.ahmad/Downloads/Compiler_Validation/random_test_generator_v1/random_generated_designs/design3/rtl/design3_5_5_top.v
verific -import -all design3_5_5_top

synth_rs \
    -top design3_5_5_top \
    -tech genesis \
    -goal area \
    -verilog design3_5_5_top_netlist.v \
    -no_dsp \
    -no_bram \
    -effort medium
    
write_blif accumulator.blif
write_verilog -noattr -nohex design3_5_5_top_netlist.v